* Check values in list
:PROPERTIES:
:header-args: sql :engine postgresql :dbuser nico :database extrasolar
:END:

** The spectral_type column in the stars table is currently defined as a one-character string that contains one of the following 7 values: 'O', 'B', 'A', 'F', 'G', 'K', and 'M'. However, there is currently no enforcement on the values that may be entered. Add a constraint to the table stars that will enforce the requirement that a row must hold one of the 7 listed values above. Also, make sure that a value is required for this column.
#+BEGIN_SRC sql
  ALTER TABLE stars
    ALTER spectral_type SET NOT NULL;
#+END_SRC

#+BEGIN_SRC sql
  ALTER TABLE stars
    ADD CHECK(spectral_type = ANY(ARRAY['O', 'B', 'A','F','G','K','M']));
#+END_SRC

#+RESULTS:
| ALTER TABLE |
|-------------|
